{
  "217539": {
    "id": "217539",
    "title": "Spam and trash",
    "description": "You can mark tickets as spam or delete tickets automatically and manually. This way, unwanted tickets don't clutter your agents' ticket list, and your reports are not skewed by them.To manually mark a ticket as spam or to delete a ticket, click on the respective buttons available above each ticket:\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50008638064/original/GnF4rePGoilSc4122XDLZCi-pfMBGLeclg.png?1686899578)\nYou can also do this using bulk actions by selecting the tickets that you want to delete or mark as spam in the ticket list page and choosing the appropriate action on top:\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50008638085/original/96uxL2ssfinHUcnWOWYHTub6_63nehhIEw.png?1686899690)\nWhen you manually mark a ticket as spam, you will be shown an option to block the contact who sent the spam ticket. If you block the contact, the subsequent tickets sent by them will be marked as spam automatically. This contact can be found in the 'Deleted' contacts list as a part of the Contacts page, from where it can be restored if required.\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011678111/original/FB2tEeYcLvqYn3TwN-LTScXZNU_o_ZhRcQ.gif?1714391584)\nAutomation rule to spam/delete ticketsUsing automation by setting up Ticket creation automation rules, you can mark a ticket as spam/delete tickets. For example, you can delete all the auto-replies coming in, or you can mark all tickets coming from a particular contact as spam automatically. To set this up, navigate to Admin > Automations > Ticket Creation > New Rule\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50008638177/original/tI4mwb41NPVSV_0ooJMfb4I8pzB4X5sG0g.png?1686900211)\nYou can see all the tickets in spam and trash at any time by clicking on the corresponding ticket view:\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/35328568/original/AXwIxlG--zdnExt9c01mpIi9UHO9A-IOLA.png?1507299461)\nIn the spam/trash ticket view, you can perform bulk actions like restoring selected tickets or deleting them forever. You can also empty all your spam or trash in one go by clicking on the link on the right.\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011677886/original/0j1_CBObnnrQO0swR06LLAOi_kGwkvgFQw.png?1714390139)\n\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011677892/original/SINGCoYfcbtE7IvHrfq_WTBLItZjZRRong.png?1714390155)\nA ticket will only be present in the spam or trash view for 30 days, after which Freshdesk will permanently delete it. Before 30 days, you can undelete a ticket or remove it from spam anytime by using the options available within the ticket.Note:  Tickets marked as Spam are not included in the Reports or Analytics metrics.How does a ticket get marked as spam?There are three ways in which a ticket can end up in the Spam folder -Manually marked as Spam by an Agent.Ticket marked as Spam by an Automation rule such as the Ticket creation or the Ticket Update rule.Any ticket raised from a deleted user in Freshdesk would go to Spam automatically.If the ticket was manually marked as Spam by an Agent you and if the ticket is a vaild one, you can find the ticket under Tickets > Ticket views > Spam > open the ticket > Not spam. Once the ticket is restored, you can click Show activities to find out how the ticket was marked Spam.You would be able to find out if the ticket was marked spam either by Automations or marked by an agent, etc.If a contact is already in the deleted list, and if the user reports a valid ticket, you should restore the contact from Contacts > Contact views > search if the contact is found there > click the contact > Restore. Any upcoming tickets from the contact will not be marked spam going forward. To find out how the contact was deleted, kindly reach out to our support.There's an alternate way to track tickets that got spammed, you can tag such tickets using Ticket Updates automation as shown below. The same tag can be used in filters in your analytics report to track all the tickets marked spam.\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011677913/original/rYzUo7Nll-i-QPvNue1yCBL8NYzCCjV_5w.png?1714390301)\nPlease refer [How to protect your helpdesk from spam attack](https://support.freshdesk.com/en/support/solutions/articles/239858-how-to-protect-your-helpdesk-from-spam-attack-)",
    "folder_name": "Policies",
    "category_name": "Policies and Data Protection",
    "path": "/freshservice/policies-and-data-protection/policies/spam-and-trash.mdx",
    "tags": "freshdesk_old_sprout,freshdesk_free,css_growth,omnichannel_old_estate,omnichannel_growth",
    "file_part": 1
  },
  "50000006424": {
    "id": "50000006424",
    "title": "Legal policies",
    "description": "",
    "folder_name": "Freddy AI agent",
    "category_name": "Support Guide: IT Service Management",
    "path": "/freshservice/support-guide-it-service-management/freddy-ai-agent/legal-policies.mdx",
    "tags": "",
    "file_part": 1
  },
  "50000009713": {
    "id": "50000009713",
    "title": "Config Sets",
    "description": "Note: This article is on the new Sandbox which is now enabled for Enterprise plan customers. For Freshservice's current Sandbox version click [here](https://support.freshservice.com/en/support/solutions/articles/240613). Click [here](https://support.freshservice.com/en/support/solutions/articles/50000009922) to learn more about its phase-out plan.Use config sets to send configurations from one instance to another. For example, you can create and test a new workflow automator in the Sandbox instance, then sync it to Production using a config set. Remember, you can only sync admin configurations using config sets, not TCPR records.Managing Config Sets  In global settings:    Only Play god admins can view, create, and sync configurations using Config sets.Only configurations from modules in the global settings can be added and synced.In workspace settings:    Both play god, and workspace admins can view, create, and sync configurations using Config setsOnly configurations from modules in the workspace settings can be added and synced. Global configurations cannot be added directly but can be added as part of the dependency check. When a config set contains Global configurations added as part of the dependency check, only Play God admins can sync such config sets.Syncing changes using Config SetsAn outward config set is created in the Freshservice instance where you are logged in (e.g. Sandbox) and want to sync it to another instance (e.g. Production). Typically, an outward configuration set is used for configurations created and tested in a sandbox and then synced to the production instance.A config set can contain up to 250 configurations, including dependencies. If your sync requirement exceeds 250, it is advisable to divide it into multiple configuration sets.To create a Config Set and sync changes from a source to the target instance, follow these steps:Go to Admin > Sandbox within the source instance (e.g. Sandbox).     \n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011869755/original/j_-wSaDcRXddUhXIEP1Rn1OujKGPDvOhhA.png?1715953407)\n\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011869757/original/G05-OAQwlJsniZYwQafYYSjKycStcdoVHA.png?1715953407)\nNavigate to the ‘Outward Sync’ tab and click the 'Create Config Set' button. Provide the required details (Name, Description, Source, and Target) and click ‘Create’. This will create a Config Set.\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011869760/original/S3BhHTEmy7lYScC1uH0wqKzipDMb80w3ow.png?1715953408)\n\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011869761/original/MGDjdvM7dTuIuyKmV3u2xFuBdav6_0u6Sw.png?1715953408)\nYou’ll find all the modules supported for sync on the left side of the screen. \n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011869762/original/UaScSmkDlfejSKxRV7CkaccJVNfuOPvgyQ.png?1715953409)\nGo to the desired module and select the required configurations using the checkbox. You can use filters to narrow your search. Add configurations of your choice to the list and click ‘Save and Continue’.\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011869758/original/5_bkxJ4_zAXIM3iCjouC-tQ94IGeGzflMA.png?1715953408)\nThe system runs a quick [dependency](https://support.freshservice.com/en/support/solutions/articles/50000009718) check to add any required dependencies and lists them for your reference.\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011869759/original/zeKSc_kcIaUwnZPEWmFGNikmgUW6f1mK8A.png?1715953408)\nReview all the dependencies and add them to your Config Set. Note: It is mandatory to add all the required dependencies to your Config Set to move forwardOnce configurations are added to the config set, Freshservice lets you preview the list of configurations. You can view if the sync adds or updates at a configuration level and initiate a sync by clicking “Sync Configurations.”\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011869763/original/aM_6APOaiWOkJB9NW_1BmaxMtubvjUGppA.png?1715953409)\nDepending on the number and complexity of the configurations, sync might take a few seconds to several minutes. We’ll email you once the sync is completed. Alternatively, you can track the sync status from the ‘[Inward Sync](https://support.freshservice.com/en/support/solutions/articles/50000009721)’ tab in the target instance (e.g. Production)\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011869765/original/ieANM8ztKUMhSGgg6oJATwr2fBGyvY3Tvw.png?1715953413)\nNote: Once synced, Config Sets serve as sync history. They cannot be edited or deleted.Add/remove configurations from the Config SetA Config Set can be kept in a draft state if more changes are expected. All such Config Sets are found in the ‘Outward Sync’ tab with ‘Sync Status’ = ‘Not Initiated.’Under the ‘Outward Sync’ tab, click on the Config Set you wish to edit. \n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011869764/original/pOeopLzlqDkmWMnWY3dq5MWWTXuAA5GGZQ.png?1715953412)\nThe list of pre-selected configurations will be displayed. You can add or remove configurations. After making changes, the process repeats. (refer to the ‘Syncing changes using Config Sets’ section)\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011869766/original/QdEi8HyFTVOyruS9TYXr0vgrOjD_gyc2Rw.png?1715953413)\n",
    "folder_name": "New Sandbox",
    "category_name": "Getting started with Freshservice",
    "path": "/freshservice/getting-started-with-freshservice/new-sandbox/config-sets.mdx",
    "tags": "",
    "file_part": 1
  },
  "50000005586": {
    "id": "50000005586",
    "title": "Workspace Views",
    "description": "Note: Applicable only for accounts in which workspaces have been enabled.TABLE OF CONTENTS[Working with List Views](#Working-with-List-Views)[Working with Kanban Views](#Working-with-Kanban-Views)Working with List ViewsAll tickets are available in either a classic List view or a Kanban board view. \n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50007095013/original/ajX0qKD_EKgl8MYXi4n8Hr6YwfO09Y8k5w.png?1670399643)\nAgents who are part of multiple workspaces: View filter fields and column customizer fields that are common to all workspaces (also called global fields) when they choose the ‘All workspaces’ option\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50007095012/original/Ue2XHOqdOI9OT7Yn5NtNAboqGRGOmOPZjA.png?1670399642)\nCan select a workspace from the drop-down menu while viewing tickets. After they choose a workspace, they will view filter fields, and column customizer fields specific to that particular workspace (also called local fields) only\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50007095008/original/y2fSLDWwqGmUQBtwgpOGK3a1QFOZfvq5zA.png?1670399642)\n\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50007095004/original/L2L0sXj_7NYRxEUn4SBkMHFBE8pccaNyBA.png?1670399641)\nAgents who have access to only one workspace will only view filter fields and column customiser fields that are specific to that particular workspace only.When the ‘All Workspaces’ option is chosen, only fields that are common to all workspaces are visible in the filter fields and column customiser fields.\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50007095009/original/4tkcCr-FPi3BoKE1U3fNN3MQbHSJFz6J1Q.png?1670399642)\nWhat is a Bulk update?A bulk update is when an agent updates multiple tickets within a workspace simultaneously. \n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50007095005/original/MyZQ7U_eLQhe-YirLRqTiACVFhViEIHKkA.png?1670399641)\nWorking with Kanban ViewsInside every ticket, agents can see which workspace the ticket is assigned to in the form of an icon in the Kanban board view. \n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50007095006/original/lWo-Cynfhz8OuSshycMW95HD_kaSfNutRQ.png?1670399641)\nAgents who are part of multiple workspaces, View filter fields that are common to all workspaces (also called global fields) when they choose the ‘All Workspaces’ option\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50007095007/original/nLHInrch-rq-vO6VFfpkEFJOWsIeRUxVBw.png?1670399641)\nView filter fields specific to a workspace when that workspace is chosen from the dropdown menu\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50007095014/original/YqmPhijiYCMT9zKRb4v3qE5FiLk_-_TEuQ.png?1670399646)\nAgents who have access to only a specific workspace will only view filter fields specific to that workspace (also called local fields). In case the ‘All Workspaces’ option is chosen, only fields that are common to all workspaces are visible in the filter fields.",
    "folder_name": "Workspaces",
    "category_name": "Enterprise Service Management",
    "path": "/freshservice/enterprise-service-management/workspaces/workspace-views.mdx",
    "tags": "",
    "file_part": 2
  },
  "234757": {
    "id": "234757",
    "title": "Importing Assets",
    "description": "You can create or update assets in bulk by importing a CSV file. Here are some general guidelines on importing the assets. Preparing for first-time Asset ImportIf you need to create custom Asset Types, then create them before you begin the import. (You can create new asset types by going to Admin -> Asset Types)If you need to create custom asset fields for each asset type, then create them before you begin the importIf you have created new fields such as Drop Down fields which can have choices, ensure that you add the choices under Admin -> Asset Types before importPreparing your CSV file for uploadSplit your CSV file by Asset Type - You can only import assets of one asset type in one go. As a first step, create a separate file for each asset type.Required columnsBy default, the Display Name is the only field required for an asset by Freshservice. Ensure that your CSV has this columnIf you have configured any fields as required, ensure that these are also available in your CSVAttached is a sample CSV file for Laptop Asset Type (Tip: You can get a template for any asset type by creating a sample asset in Freshservice and exporting it. Make sure you select All Fields when exporting the file to get all the possible fields for that asset type)To assign an user to an asset, specify the email id of the user in the Used By field. To assign an agent to an asset as Managed By, specify the email id of the agent in the Managed By fieldImporting the File\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/40326448/original/qrnCM4u051udnrv3L5YYkzemNkOscPpfqQ.png?1534774375)\nGo to Inventory ->  ImportSelect the Asset Type you want to importUpload the CSV file Choose how to Match Records in the CSV with assets in Freshservice. If the Asset Type is selected for Import Hardware or it's child types, you can match records by Serial Number (Default), Display Name or Asset Tag.If any other asset type is selected, you can choose to not match records at all (Default - This will create all the entries in the CSV as new assets) or match records by Display Name or Asset TagClick NextMapping Fields\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/40317835/original/Ibse-4bydd7bRqVP3Bq21KpYrp413SyZjg.png?1534748615)\nFreshservice automatically maps the fields in your CSV based on the header in the CSV. The values of the first asset entry in the CSV file are also shown as an example next to the mappingYou can review this mapping and make any changes as neededEnsure the date format selected and the date format in the CSV matches if you wish to update any date fieldsClick Import to start the import process.The import status screen shows the current status of the import. The status is updated every 30 secondsOnce the import is complete, you will get an import status and a quick summary of errors encountered during the importAn email with an import status report will also be sent to the user who initiated the report once the import is completedCommon asset errors:Serial number must be unique: To avoid the above error \"Serial number must be unique\" make sure the respective assets are not a part of the inventory trash folder. To access trash click on the 3 lines near the inventory > Trash.\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011982079/original/rpDte-uAFuTNY_8qUssuaL9Myp0RR6WPKg.png?1716975208)\nAsset Type Mismatch: Check if the asset type is mapped correctly during the import. This error can also occur if the asset is already present under a different asset type in inventory.Date format mismatch: Ensure the date format in the CSV matches the date format selected while doing an import in the portal. Try exporting a sample file from the inventory module for the corresponding asset type and then use the file to import the data. This way you would be able to identify the format in which the fields are being passed. Also kindly check with below points.Validate the CSV file used for importing the asset. Check if the date format in the CSV matches the date format selected while doing an import, as shown below. \n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011982667/original/iOe7WvaQi6wiEwnls7UO9dyfu8KfovYt4Q.png?1716977412)\n\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011982666/original/elVx9mfSDqY_ltcUL2puXwSmodZi78ci4g.png?1716977412)\nOnce the date format is updated as expected, the system successfully recognizes the date field and uploads the asset.\n![Image](https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/50011982665/original/hA6RYRGv0tPZfRcjXO1dUYdqBv40P9Qr9g.png?1716977411)\n",
    "folder_name": "Get started with Assets",
    "category_name": "Support Guide: IT Asset Management",
    "path": "/freshservice/support-guide-it-asset-management/get-started-with-assets/importing-assets.mdx",
    "tags": "",
    "file_part": 2
  }
}